Repository: legumeinfo/brilliant_gallery
Catalog: translations/*.po
Languages: hu

source: None
hu: Nincs

source: Random image
hu: Véletlenszerű kép

source: Media
hu: Média

source: Maximum number of table columns
hu: A táblázat oszlopainak maximális száma

source: The maximum number of columns displayed in the table.
hu: A táblázatban megjelenő oszlopok számának felső határa.

source: Maximum width of table images
hu: Táblázat képeinek megengedett legnagyobb szélessége

source: The maximum width of thumbnails in the table (height calculated automatically).
hu: Bélyegképek szélességének megengedett legnagyobb értéke a táblázatban (a magasság automatikusan lesz ehhez igazítva).

source: Table background colour
hu: Táblázat háttérszíne

source: Table cell padding
hu: Térköz a táblázat celláiban

source: Cell padding (around each image) in pixels.
hu: Térköz a cellákban (minden kép körül) képpontban megadva.

source: Overlay browser
hu: Képnézegető

source: Select the overlay image browser (must be installed, of course).
hu: Képnézegető kiválasztása (természetesen telepíteni kell)

source: Brilliant gallery module settings
hu: Brilliant gallery modul beállításai

source: access brilliant_gallery
hu: hozzáférés a brilliant_galleryhez

source: Brilliant Gallery: A random image
hu: Brilliant Gallery: egy véletlenszerű kép

source: Display one random image from the respective gallery.
hu: Egy véletlenszerű kép megjelenítése az adott fényképalbumból.

source: Highly customizable Drupal module creating a table gallery of quality-scaled images from any number of folders.
hu: Széleskörűen beállítható Drupal modul, amellyel már meglévő könyvtárakból lehet minőségi átméretezett képeket tartalmazó galériákat létrehozni.

source: Pick colour of the background of the table that holds the images.
hu: A képeket tartalmazó táblázat háttérszínének beállítása.

source: Current background color
hu: Jelenlegi háttérszín

source: Maximum width of full image
hu: Teljes kép legnagyobb szélessége

source: Very large images will be scaled down to this width (in pixels) for display before they get displayed by the overlay browser.
hu: Nagyon nagy méretű képek át lesznek méretezve erre a szélességre (képpontban) mielőtt azokat a képnézegető megjelenítené.

source: Display file name as caption
hu: Fájl nevének megjelenítése feliratként

source: Check this if you want the overlay browser to display a caption based on the image file name (dots and underscores are automatically replaced by spaces).
hu: Bejelölése esetén a képnézegető a fájl nevén alapuló feliratot jelenít meg (pontok és aláhúzások helyett automatikusan szóköz jelenik meg).

source: Sort or randomize image order
hu: Képek listázása sorrendben vagy véletlenszerűen

source: Sort images by their file names alphabetically.
hu: Képek rendezése betűrendben a fájlnevek alapján.

source: The order of your gallery images will always be randomized (on each page load or cache refresh).
hu: A galériában szereplő képek mindig véletlenszerű sorrendben jelennek meg (minden oldal-betöltéskor vagy gyorstár frissítéskor).

source: Configure permissions
hu: Jogosultságok beállítása

source: Configure access permissions for the Brilliant gallery module
hu: Hozzáférési jogosultságok beállítása a Brilliant gallery modul számára

source: Substitutes a special Brilliant Gallery Tag with the actual gallery table.
hu: Speciális Brilliant Gallery címke helyettesítése az aktuális galériát tartalmazó táblázattal.

source: access administration pages
hu: adminisztrációs oldalak hozzáférése

source: User ID.
hu: A felhasználó azonosítója.

source: Manage galleries
hu: Galériák kezelése

source: Manage galleries displayed using the Brilliant gallery module - e.g. visibility of individual images, etc.
hu: Galériák megjelenítésének kezelése a Brilliant gallery modul segítségével, például egyedi képek láthatósága stb.

source: Table tracing which Brilliant Gallery images are hidden or visible.
hu: Táblázat rajzolása, hogy melyik Brilliant Gallery kép rejtett vagy látható.

source: Unused now.
hu: Most nincs használatban.

source: Image.
hu: Kép.

source: Visible or invisible.
hu: Látható vagy láthatatlan.

source: Highly customizable Drupal module producing multiple table galleries of quality-scaled images from either a pre-defined local folder, or from any public Picasa gallery.
hu: Széleskörűen beállítható Drupal modul, amellyel minőségi átméretezett képek többszörös galériája hozható létre akár előre megadott helyi könyvtárból vagy bármelyik nyilvános Picasa albumból.

source: Expiration time of the gallery cache (in days)
hu: Galéria gyorsítótárának elavulásának ideje (napokban)

source: Images and other gallery structures are cached to improve speed of serving. Here you can set how long time they should be cached.
hu: Képek és más galériaszerkezetek gyorsítótárazása a megjelenítés sebességének növelése érdekében. Itt állítható be a gyorsítótár elavulásának ideje.

source: Crop to square
hu: Négyszögre vágás

source: If selected, all image thumbnails will have the same square shape.
hu: Kiválasztása esetén minden bélyegkép ugyanakkora négyszög alakú lesz.

source: Path to the main gallery folder (for local, non-Picasa galleries)
hu: A fő galéria könyvtárára mutató útvonal (helyi, nem Picasa galéria)

source: Path to the main folder in which your individual gallery folders will be placed. Such folder must exist under your /files folder. Exclude trailing slashes. Example: <i>albums</i>. Leave empty if you wish your 'files' folder to be your album folder.
hu: A fő könyvtárra mutató útvonal, ahol az egyedi galériákat tartalmazó könyvtárak találhatók. Ilyen könyvtárat a „files” könyvtárban kell létrehozni. A záró perjelek használata tilos. Pédául: <em>albumok</em>. Üresen hagyása esetén a fájlrendszer könyvtára lesz a galériák könyvtára.

source: Path to Picasa image CACHE folder
hu: Picasa kép gyorsítótárának útvonala

source: Path to a folder in which images fetched from Picasa will be temporarily stored. Such folder must exist under your /files folder. Exclude trailing slashes. Example: <i>bgcache</i>. Remember: PHP has to have the permission to write into that directory! <br>Leave empty if you wish your usual Drupal temp directory (see /admin/settings/file-system) be used for this cache. (If you are on a dedicated server, this can be your server's /tmp folder, but if you are on a shared host, it is important this path is somewhere inside your /files directory, esp. if you are fetching a large number of images from Picasa.)
hu: A Picasa albumok képeinek ideiglenes tárolására szolgáló könyvtár útvonala. Ilyen könyvtárat a „files” könyvtárban kell létrehozni. A záró perjelek használata tilos. Például: <em>picasa</em>. Emlékeztető: a PHP-nak írási joga kell legyen ebben a könyvtárban! Üresen hagyása esetén a Drupal szokásos ideiglenes fájlok könyvtára lesz a gyorsítótár (lásd Adminisztráció/Webhely beállítása/Fájlrendszer). (Ha ez egy dedikált szerver, akkor ez a szerver /tmp könyvtára lehet, de ha ez egy tárhely szolgáltatónál található, akkor fontos, hogy az útvonal valahol a „files” könyvtáron belül legyen, különösen, ha nagy számú Picasa képet kell beolvasni.)
